import math


def area(r):
    '''
    Возвращает площадь круга.

        Параметры:
            r (int, float): радиус круга

        Возвращаемое значение:
            (float): площадь круга
    
    Пример вызова:
        >>> area(7)
        153.93804002589985
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности (периметр круга).

        Параметры:
            r (int, float): радиус круга

        Возвращаемое значение:
            (float): длина окружности

    Пример вызова:
        >>> perimeter(9)
        56.548667764616276
    '''
    return 2 * math.pi * r
