def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a (int, float): высота прямоугольника
            b (int, float): ширина прямоугольника

        Возвращаемое значение:
            (int or float): площадь прямоугольника

    Пример вызова:
        >>> area(4, 5)
        20
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a (int, float): высота прямоугольника
            b (int, float): ширина прямоугольника

        Возвращаемое значение:
            (int or float): периметр прямоугольника

    Пример вызова:
        >>> perimeter(4, 5)
        18
    '''
    return 2 * (a + b)