
def area(a):
    '''
    Возвращает площадь квадрата.

        Параметры:
            a (int): длина стороны квадрата

        Возвращаемое значение:
            (int): площадь квадрата

    Пример вызова:
        >>> area(4)
        16
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

        Параметры:
            a (int): длина стороны квадрата

        Возвращаемое значение:
            (int): периметр квадрата

    Пример вызова:
        >>> perimeter(6) 
        24
    '''
    return 4 * a
