
def area(a):
    '''
    Возвращает площадь квадрата.

        Параметры:
            a (int, float): длина стороны квадрата

        Возвращаемое значение:
            (int or float): площадь квадрата
    Пример вызова:
            >>> area(4)
            16
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

    Параметры:
        a (int, float): длина стороны квадрата

    Возвращаемое значение:
        (int or float): периметр квадрата
    '''
    return 4 * a
v = int(input())
print(area(v))