def area(a, b, c):
    '''
    Возвращает площадь треугольника.

        Параметры:
            a (float): длина первой стороны треугольника
            b (float): длина второй стороны треугольника
            c (float): длина третьей стороны треугольника

        Возвращаемое значение:
            (float): площадь треугольника

    Пример вызова:
        >>> area(3, 4, 5)
        6.0
    '''
    p = (a + b + c) / 2
    return (p * (p - a) * (p - b) * (p - c)) ** 0.5


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.

        Параметры:
            a (int): длина первой стороны треугольника
            b (int): длина второй стороны треугольника
            c (int): длина третьей стороны треугольника

        Возвращаемое значение:
            (int): периметр треугольника

    Пример вызова:
        >>> perimeter(3, 4, 5)
        12
    '''
    return a + b + c